producer/app/service/random_transaction_service.rb

SELECT "accounts".* FROM "accounts"
---
  def stop
    @workers.each {|t| Thread.kill t}

    account_info = []
    Account.all.each do

SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_id" = ? LIMIT ?  [["account_id", "02"], ["LIMIT", 1]]
UPDATE "accounts" SET "balance" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["balance", 653281], ["updated_at", "2020-03-18 15:25:01.655454"], ["id", 4]]
---
  def process_random_transaction(prodcuer_id: "01" ,account_id: "01")
    loop do
      account = Account.find_by(account_id: account_id)

      amount = RandomHelper.gen_random
      while (amount + account.balance) < 0
        amount = RandomHelper.gen_random
      end

      log_entry = {
          prodcuer_id: prodcuer_id,
          transaction_id: SecureRandom.uuid,
          amount: amount,
          balance: account.balance + amount
      }
      @transaction_logs << log_entry
      @message_queue.publish(log_entry)

      account.balance += amount
      account.save!